garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1773.PIC
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP7CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP7CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x29B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP7MODE" edc:desc="" edc:mask="0xf" edc:name="CCP7MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP7FMT" edc:desc="" edc:mask="0x1" edc:name="CCP7FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7OUT" edc:desc="" edc:mask="0x1" edc:name="CCP7OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP7EN" edc:desc="" edc:mask="0x1" edc:name="CCP7EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP7MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP7MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP7MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP7MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP7MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CCP7CAP" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CCP7CAP" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x29C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0xf" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS3" edc:desc="" edc:mask="0x1" edc:name="CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP7CTS" edc:desc="" edc:mask="0xf" edc:name="CCP7CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP7CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP7CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP7CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP7CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7CTS3" edc:desc="" edc:mask="0x1" edc:name="CCP7CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x29D"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCPTMRS1" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCPTMRS1" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x29E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="C7TSEL" edc:mask="0x3" edc:name="C7TSEL" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:desc="" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:desc="" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:desc="" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:desc="" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7TSEL0" edc:desc="" edc:mask="0x1" edc:name="C7TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7TSEL1" edc:desc="" edc:mask="0x1" edc:name="C7TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCPTMRS2" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCPTMRS2" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x29F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P3TSEL" edc:desc="" edc:mask="0x3" edc:name="P3TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P4TSEL" edc:desc="" edc:mask="0x3" edc:name="P4TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P9TSEL" edc:desc="" edc:mask="0x3" edc:name="P9TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P3TSEL0" edc:desc="" edc:mask="0x1" edc:name="P3TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3TSEL1" edc:desc="" edc:mask="0x1" edc:name="P3TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P4TSEL0" edc:desc="" edc:mask="0x1" edc:name="P4TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P5TSEL1" edc:desc="" edc:mask="0x1" edc:name="P5TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P9TSEL0" edc:desc="" edc:mask="0x1" edc:name="P9TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P9TSEL1" edc:desc="" edc:mask="0x1" edc:name="P9TSEL1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x300"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONA" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x30C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:desc="" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA1" edc:desc="" edc:mask="0x1" edc:name="SLRA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:desc="" edc:mask="0x1" edc:name="SLRA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA3" edc:mask="0x1" edc:name="SLRA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA4" edc:desc="" edc:mask="0x1" edc:name="SLRA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA5" edc:desc="" edc:mask="0x1" edc:name="SLRA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA6" edc:mask="0x1" edc:name="SLRA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA7" edc:mask="0x1" edc:name="SLRA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONB" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x30D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRB0" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB1" edc:mask="0x1" edc:name="SLRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB2" edc:mask="0x1" edc:name="SLRB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB3" edc:mask="0x1" edc:name="SLRB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB4" edc:desc="" edc:mask="0x1" edc:name="SLRB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRB5" edc:desc="" edc:mask="0x1" edc:name="SLRB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRB6" edc:desc="" edc:mask="0x1" edc:name="SLRB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRB7" edc:desc="" edc:mask="0x1" edc:name="SLRB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x30E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRC0" edc:desc="" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC1" edc:desc="" edc:mask="0x1" edc:name="SLRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC2" edc:desc="" edc:mask="0x1" edc:name="SLRC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC3" edc:desc="" edc:mask="0x1" edc:name="SLRC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC4" edc:desc="" edc:mask="0x1" edc:name="SLRC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC5" edc:desc="" edc:mask="0x1" edc:name="SLRC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC6" edc:desc="" edc:mask="0x1" edc:name="SLRC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC7" edc:desc="" edc:mask="0x1" edc:name="SLRC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
