garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1773.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD2CARH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="MD2CARH" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x31F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH" edc:desc="" edc:mask="0x1f" edc:name="CH" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CH0" edc:desc="" edc:mask="0x1" edc:name="CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH1" edc:desc="" edc:mask="0x1" edc:name="CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH2" edc:desc="" edc:mask="0x1" edc:name="CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH3" edc:desc="" edc:mask="0x1" edc:name="CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH4" edc:desc="" edc:mask="0x1" edc:name="CH4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD2CH" edc:desc="" edc:mask="0x1f" edc:name="MD2CH" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD2CH0" edc:desc="" edc:mask="0x1" edc:name="MD2CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH1" edc:desc="" edc:mask="0x1" edc:name="MD2CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH2" edc:desc="" edc:mask="0x1" edc:name="MD2CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH3" edc:desc="" edc:mask="0x1" edc:name="MD2CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CH4" edc:mask="0x1" edc:name="MD2CH4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x380"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLA" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x38C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:desc="" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:desc="" edc:mask="0x1" edc:name="INLVLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:desc="" edc:mask="0x1" edc:name="INLVLA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:desc="" edc:mask="0x1" edc:name="INLVLA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:desc="" edc:mask="0x1" edc:name="INLVLA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:desc="" edc:mask="0x1" edc:name="INLVLA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA6" edc:mask="0x1" edc:name="INLVLA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA7" edc:mask="0x1" edc:name="INLVLA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVA0" edc:desc="" edc:mask="0x1" edc:name="INLVA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVA1" edc:desc="" edc:mask="0x1" edc:name="INLVA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVA2" edc:desc="" edc:mask="0x1" edc:name="INLVA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVA3" edc:desc="" edc:mask="0x1" edc:name="INLVA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVA4" edc:desc="" edc:mask="0x1" edc:name="INLVA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVA5" edc:desc="" edc:mask="0x1" edc:name="INLVA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVA6" edc:mask="0x1" edc:name="INLVA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVA7" edc:mask="0x1" edc:name="INLVA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLB" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x38D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLB0" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB1" edc:mask="0x1" edc:name="INLVLB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB2" edc:mask="0x1" edc:name="INLVLB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB3" edc:mask="0x1" edc:name="INLVLB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB4" edc:desc="" edc:mask="0x1" edc:name="INLVLB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB5" edc:desc="" edc:mask="0x1" edc:name="INLVLB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB6" edc:desc="" edc:mask="0x1" edc:name="INLVLB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB7" edc:desc="" edc:mask="0x1" edc:name="INLVLB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVB0" edc:mask="0x1" edc:name="INLVB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVB1" edc:mask="0x1" edc:name="INLVB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVB2" edc:mask="0x1" edc:name="INLVB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVB3" edc:mask="0x1" edc:name="INLVB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVB4" edc:desc="" edc:mask="0x1" edc:name="INLVB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVB5" edc:desc="" edc:mask="0x1" edc:name="INLVB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVB6" edc:desc="" edc:mask="0x1" edc:name="INLVB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVB7" edc:desc="" edc:mask="0x1" edc:name="INLVB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x38E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLC0" edc:desc="" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC1" edc:desc="" edc:mask="0x1" edc:name="INLVLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC2" edc:desc="" edc:mask="0x1" edc:name="INLVLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC3" edc:desc="" edc:mask="0x1" edc:name="INLVLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC4" edc:desc="" edc:mask="0x1" edc:name="INLVLC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC5" edc:desc="" edc:mask="0x1" edc:name="INLVLC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC6" edc:desc="" edc:mask="0x1" edc:name="INLVLC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC7" edc:desc="" edc:mask="0x1" edc:name="INLVLC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x38F"/>
        <edc:SFRDef edc:access="----n---" edc:cname="INLVLE" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1---" edc:name="INLVLE" edc:nzwidth="8" edc:por="----1---" edc:_addr="0x390">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INLVLE3" edc:mask="0x1" edc:name="INLVLE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x391">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:desc="" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:desc="" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:desc="" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:desc="" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:desc="" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:desc="" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP6" edc:mask="0x1" edc:name="IOCAP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP7" edc:mask="0x1" edc:name="IOCAP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x392">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:desc="" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:desc="" edc:mask="0x1" edc:name="IOCAN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:desc="" edc:mask="0x1" edc:name="IOCAN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:desc="" edc:mask="0x1" edc:name="IOCAN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:desc="" edc:mask="0x1" edc:name="IOCAN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:desc="" edc:mask="0x1" edc:name="IOCAN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN6" edc:mask="0x1" edc:name="IOCAN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN7" edc:mask="0x1" edc:name="IOCAN7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x393">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:desc="" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:desc="" edc:mask="0x1" edc:name="IOCAF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:desc="" edc:mask="0x1" edc:name="IOCAF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:desc="" edc:mask="0x1" edc:name="IOCAF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:desc="" edc:mask="0x1" edc:name="IOCAF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:desc="" edc:mask="0x1" edc:name="IOCAF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF6" edc:mask="0x1" edc:name="IOCAF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF7" edc:mask="0x1" edc:name="IOCAF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBP" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x394">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBP0" edc:mask="0x1" edc:name="IOCBP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP1" edc:mask="0x1" edc:name="IOCBP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP2" edc:mask="0x1" edc:name="IOCBP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP3" edc:mask="0x1" edc:name="IOCBP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBN" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x395">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBN0" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN1" edc:mask="0x1" edc:name="IOCBN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN2" edc:mask="0x1" edc:name="IOCBN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN3" edc:mask="0x1" edc:name="IOCBN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBF" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x396">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBF0" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF1" edc:mask="0x1" edc:name="IOCBF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF2" edc:mask="0x1" edc:name="IOCBF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF3" edc:mask="0x1" edc:name="IOCBF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCP" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x397">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:desc="" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:desc="" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:desc="" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:desc="" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:desc="" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:desc="" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:desc="" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP7" edc:desc="" edc:mask="0x1" edc:name="IOCCP7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCN" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x398">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:desc="" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:desc="" edc:mask="0x1" edc:name="IOCCN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:desc="" edc:mask="0x1" edc:name="IOCCN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:desc="" edc:mask="0x1" edc:name="IOCCN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:desc="" edc:mask="0x1" edc:name="IOCCN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:desc="" edc:mask="0x1" edc:name="IOCCN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:desc="" edc:mask="0x1" edc:name="IOCCN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN7" edc:desc="" edc:mask="0x1" edc:name="IOCCN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCF" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x399">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:desc="" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:desc="" edc:mask="0x1" edc:name="IOCCF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF2" edc:desc="" edc:mask="0x1" edc:name="IOCCF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:desc="" edc:mask="0x1" edc:name="IOCCF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:desc="" edc:mask="0x1" edc:name="IOCCF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:desc="" edc:mask="0x1" edc:name="IOCCF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF6" edc:desc="" edc:mask="0x1" edc:name="IOCCF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF7" edc:desc="" edc:mask="0x1" edc:name="IOCCF7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
