garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1773.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADRESH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x48F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRES" edc:mask="0xff" edc:name="ADRES" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCON0" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x490">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:mask="0x3f" edc:name="CHS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="ADCON1" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADCON1" edc:nzwidth="8" edc:por="0000-000" edc:_addr="0x491">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ADNREF" edc:mask="0x1" edc:name="ADNREF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCON2" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCON2" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x492">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRIGSEL" edc:mask="0x3f" edc:name="TRIGSEL" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x493">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:mask="0xff" edc:name="TMR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T2PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x494">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2PR" edc:desc="" edc:mask="0xff" edc:name="T2PR" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2CON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x495">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2OUTPS" edc:desc="" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x7" edc:name="T2CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T2ON" edc:desc="" edc:mask="0x1" edc:name="T2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS2" edc:desc="" edc:mask="0x1" edc:name="T2CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2HLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2HLT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x496">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1f" edc:name="MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE4" edc:desc="" edc:mask="0x1" edc:name="MODE4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2MODE" edc:desc="" edc:mask="0x1f" edc:name="T2MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="T2CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T2CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPOL" edc:desc="" edc:mask="0x1" edc:name="T2CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PSYNC" edc:desc="" edc:mask="0x1" edc:name="T2PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2MODE0" edc:desc="" edc:mask="0x1" edc:name="T2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE1" edc:desc="" edc:mask="0x1" edc:name="T2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE2" edc:desc="" edc:mask="0x1" edc:name="T2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE3" edc:desc="" edc:mask="0x1" edc:name="T2MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE4" edc:desc="" edc:mask="0x1" edc:name="T2MODE4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T2CLKCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T2CLKCON" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x497">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0xf" edc:name="CS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:desc="" edc:mask="0x1" edc:name="CS3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CS" edc:desc="" edc:mask="0xf" edc:name="T2CS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2CS0" edc:desc="" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CS1" edc:desc="" edc:mask="0x1" edc:name="T2CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CS2" edc:desc="" edc:mask="0x1" edc:name="T2CS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CS3" edc:desc="" edc:mask="0x1" edc:name="T2CS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="T2RST" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x498">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:desc="" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:desc="" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:desc="" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:desc="" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:desc="" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:desc="" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2RSEL" edc:desc="" edc:mask="0x1f" edc:name="T2RSEL" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2RSEL0" edc:desc="" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL1" edc:desc="" edc:mask="0x1" edc:name="T2RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL2" edc:desc="" edc:mask="0x1" edc:name="T2RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL3" edc:desc="" edc:mask="0x1" edc:name="T2RSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL4" edc:desc="" edc:mask="0x1" edc:name="T2RSEL4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x499"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T8TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T8TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x49A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR8"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR8" edc:desc="" edc:mask="0xff" edc:name="TMR8" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T8PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T8PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x49B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR8"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T8PR" edc:desc="" edc:mask="0xff" edc:name="T8PR" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T8CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T8CON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x49C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T8OUTPS" edc:desc="" edc:mask="0xf" edc:name="T8OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T8CKPS" edc:desc="" edc:mask="0x7" edc:name="T8CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T8ON" edc:desc="" edc:mask="0x1" edc:name="T8ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T8OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CKPS0" edc:desc="" edc:mask="0x1" edc:name="T8CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CKPS1" edc:desc="" edc:mask="0x1" edc:name="T8CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CKPS2" edc:desc="" edc:mask="0x1" edc:name="T8CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR8ON" edc:desc="" edc:mask="0x1" edc:name="TMR8ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
