garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1773.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATA" edc:desc="" edc:mask="0x1" edc:name="SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATB" edc:desc="" edc:mask="0x1" edc:name="SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATC" edc:desc="" edc:mask="0x1" edc:name="SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDATD" edc:desc="" edc:mask="0x1" edc:name="SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3STRA" edc:desc="" edc:mask="0x1" edc:name="G3STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3STRB" edc:desc="" edc:mask="0x1" edc:name="G3STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3STRC" edc:desc="" edc:mask="0x1" edc:name="G3STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3STRD" edc:desc="" edc:mask="0x1" edc:name="G3STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATA" edc:desc="" edc:mask="0x1" edc:name="G3SDATA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATB" edc:desc="" edc:mask="0x1" edc:name="G3SDATB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATC" edc:desc="" edc:mask="0x1" edc:name="G3SDATC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3SDATD" edc:desc="" edc:mask="0x1" edc:name="G3SDATD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM4CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM4CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x90C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4SYNC" edc:desc="" edc:mask="0x1" edc:name="C4SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4HYS" edc:desc="" edc:mask="0x1" edc:name="C4HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C4ZLF" edc:desc="" edc:mask="0x1" edc:name="C4ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4POL" edc:desc="" edc:mask="0x1" edc:name="C4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C4OUT" edc:desc="" edc:mask="0x1" edc:name="C4OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4ON" edc:desc="" edc:mask="0x1" edc:name="C4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM4CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM4CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x90D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4INTN" edc:desc="" edc:mask="0x1" edc:name="C4INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4INTP" edc:desc="" edc:mask="0x1" edc:name="C4INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM4NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM4NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x90E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4NCH" edc:desc="" edc:mask="0xf" edc:name="C4NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C4NCH0" edc:desc="" edc:mask="0x1" edc:name="C4NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4NCH1" edc:desc="" edc:mask="0x1" edc:name="C4NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4NCH2" edc:desc="" edc:mask="0x1" edc:name="C4NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4NCH3" edc:mask="0x1" edc:name="C4NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
